<?php
$quiz = array();
$quiz[] = [
  'question' => 'SuperColorBasicは何色ペイントが出来た？（黒も１色と数えて）',
  'answer' => ['魅惑の３６色ペイント', '怒濤の５２色ペイント', '不可思議な１２８色ペイント', '驚愕の５１２色ペイント', '絶叫の２４色ペイント']
  //魅惑の３６色ペイント
];

$quiz[] = [
  'question' => 'キャリーのモニタＴＳシリーズ。MZ-2000用は「TS-2000」、では８０Ｂ用は？',
  'answer' => ['MONITOR TS-8801', 'MONITOR TS-MZ-80B', 'MONITOR TS-80B', 'MONITOR TS-800', 'MONITOR TS-1000']
  //MONITOR TS-8801 が答えではない
];

$quiz[] = [
  'question' => 'ハドソンのMARIO BROS. Specialに登場するカメの目の色は？',
  'answer' => ['目がない', '青い目の玉に周りがピンク', '真っ青', '赤い目の玉に周りが緑', '黒い目の玉に周りが真っ赤']
   //目が無い が答えではない
];

$quiz[] = [
  'question' => 'Super Color BASICで全面ペイントに要する時間は？（カラー番号１～７で）',
  'answer' => ['約３０秒', '約１１秒', '約１分', '約４０秒', '約５秒']
   //約１１秒
];

$quiz[] = [
  'question' => 'SuperBASEのアセンブルは何パス？',
  'answer' => ['５パス', '１パス', '２パス', '１０パス', '４パス']
   //５パス が答えではない
];

$quiz[] = [
  'question' => 'MZ-2000HuBASICで音楽再生の命令は？',
  'answer' => ['SOUND', 'CMD PLAY', 'MUSIC', 'PLAY']
   //SOUND が答えではない
];

$quiz[] = [
  'question' => '何故か「Ｘ１」と名前の付いている「ファイターＸ１」ですが、タイトル表示のスペルが違います。何て書かれているでしょう？',
  'answer' => ['「FIGHTR」', '「FITER」', '「FIVER」', '「FIGTER」', '「FIGHTR」']
   //「FIGHTR」 が答えではない
];

$quiz[] = [
  'question' => 'JELDAの説明文より出題です。「１周出来たら才能があります。２周出来れば天才です。天才の方は・・・・」さて、何でしょう？',
  'answer' => ['開発部へご招待します。', '才能があります。', '御一報下さい。', '３周目を目指しましょう。', '抽選で、お好きなソフトをプレゼントします。']
   //御一報下さい。
];

$quiz[] = [
  'question' => '雑誌Oh!MZにビブラートバージョン３重和音が掲載されました。著者は？',
  'answer' => ['わたし＋あなた', '由紀氏＋十南氏', 'No.046氏＋ＭＫ－２氏', '山本氏＋平野氏', '長谷川氏＋佐々木氏']
   //わたし＋あなた が答えではない
];

$quiz[] = [
  'question' => 'ベジタブルクラッシュに登場する野菜は、「りんご（野菜か？）」と「なす」と何？',
  'answer' => ['ピーマン', 'トマト', 'ダイコン', 'ニンジン', 'ゴボウ']
   //ピーマン が答えではない
];

$quiz[] = [
  'question' => 'MZ-2000標準テープベーシックで、画面を消去する命令はどれが正しい？',
  'answer' => ['SCREEN 0', 'CLRTEXT', 'CLR', 'PRINT CHR$(6)', 'CLS']
   //SCREEN 0 が答えではない
];

$quiz[] = [
  'question' => 'プラズマラインには海賊が登場します。名前は？',
  'answer' => ['宇宙海賊キャプテンハーロック', 'パイレーツ', '宇宙海賊ミト', '海賊ジャッカー（ズ）', 'ホネ・ボーン']
   //宇宙海賊キャプテンハーロック が答えではない
];


$quiz[] = [
  'question' => 'Color WICS2.0は雑誌Ｉ／Ｏにダンプ掲載されましたが、著者は誰？',
  'answer' => ['長谷川　氏', '平野　氏', '十南　氏', '由紀　氏', '佐々木　氏']
   //長谷川　氏 が答えではない
];

$quiz[] = [
  'question' => 'キャリーソフトのアマテニスでは、自分の打ったボールをもう一度打てる？',
  'answer' => ['打つと暴走する', '打てるが、ファールになる', '打てない', '打てないが、限りなく近づく事が出来る', '打てる']
   //打てる
];

$quiz[] = [
  'question' => 'ＭＺ－２０００付属のテープベーシックで、モニタからＢＡＳＩＣのコールドスタートを行うジャンプアドレスは？（マニュアルに書いてあるアドレスを採用します）',
  'answer' => ['２０００ｈ', '８０００ｈ', '１２Ａ０ｈ', '１３００ｈ', '１５００ｈ']
   //２０００ｈ が答えではない
];

$quiz[] = [
  'question' => 'ＳＰＳの「ぐるっぺ」の迷路は何面まである？',
  'answer' => ['３００面', '５００面', '１００面', '１５０面', '２００面']
   //３００面
];

$quiz[] = [
  'question' => 'ビクトリアスナインで、守備につくと内野にボールを投げてウォームアップをしますね。ファーストまでボールがまわると、ピッチャーへボールを手渡しに行きます。ここであることをするとどうなる？',
  'answer' => [
    'スペースキーを押しっぱなしにすると、ピッチャーの目の前でピッチャーへボールを投げる', 'Ｈキーをずっと押しておくと、ファーストとピッチャーが・・・・（自主規制）',
   '矢印の上を押しっぱなしにしておくと、外野へボールを投げて、敵にエンタイトル２ベースをプレゼント',
   'スペースを押しっぱなしにして置くと、キャッチャーへボールを投げる',
   'スペースを押しっぱなしにして置くと、キャッチャーへボールを投げる']
   //スペースキーを押しっぱなしにすると、ピッチャーの目の前でピッチャーへボールを投げる', 'Ｈキーをずっと押しておくと、ファーストとピッチャーが・・・・（自主規制）
];


$quiz[] = [
  'question' => 'HudsonのSTAR STREAM、発射した弾はどうなる？',
  'answer' => ['敵から脱げてしまう', '誘導弾なので、敵を追いかける', '遅いので、自機に追い抜かれる', 'そのまままっすぐ飛び続ける', '分裂していろんな方向へ飛んで行く']
   //敵から脱げてしまう が答えではない

];

$quiz[] = [
  'question' => 'StarLightAdv.で、雪女は何処にいた？',
  'answer' => ['RANDOM', 'IRIS', 'RASTAVAN', 'JEDAL', 'JUNO']
   //RANDOM が答えではない

];

$quiz[] = [
  'question' => 'ポーラスター２で、地上に文字が書いてありますが、なんと書いてありますか？',
  'answer' => ['ＤＡＮＧＥＲ', 'ＰＯＬＡＲ　ＣＯＳＭＥＴＩＣ', 'ＰＯＬＡＲ　ＳＴＡＲ　ＩＩ', 'ＣＯＵＴＩＯＮ', 'ＰＯＬＡＲ　ＳＴＡＲ']
   //ＰＯＬＡＲ　ＳＴＡＲ　ＩＩ
];

$quiz[] = [
  'question' => 'Ｘ’ＴＡＬ　ＳＯＦＴの高速機動部隊。立ち上がりも高速だ！',
  'answer' => ['立ち上がりで待たされたことはない', '立ち上がりから、ゲームオーバーまで約１分', '「約一分お待ち下さい」と待たされる', 'ゲームオーバーまでも高速だ！', '約３０分待たされる']
   //立ち上がりで待たされたことはない が答えではない
];

$quiz[] = [
  'question' => 'StarLightAdv2で、あなたの使命は何でしょう？',
  'answer' => ['地底人に会う', '惑星ＲＡＮＤＯＭの破壊', 'お姫様を救う', 'WICS+BASEを手に入れる', '惑星ＲＡＮＤＯＭのコンピュータの暴走を止める']
   //地底人に会う が答えではない
];

$quiz[] = [
  'question' => 'WICSでBASICの「DATA」「READ」コマンドと同じことをするには？',
  'answer' => ['そのまま「READ」「DATA」を使う', '知るか！', '「.DATA」「.GET」を使う', 'データをスタックに積んでおいて取り出しながら変数に代入']
   //そのまま「READ」「DATA」を使う が答えではない
];

$quiz[] = [
  'question' => 'StarLightAdv.2で包み爆弾を「あんたに渡すように頼まれた」と渡されますが、依頼主は誰？',
  'answer' => ['地底人', 'シャンの妹', 'マスター', 'シャン', '分からない']
   //シャン が答えではない
];

$quiz[] = [
  'question' => 'Chackn Popのトレーニングステージでは、何発目のボムで２匹以上のモンスタを倒すとスーパーチャックンが登場するか（一番少ない数を指定して下さい）
',
  'answer' => ['４発目', '５発目', '２発目', '３発目＆３匹以上で登場']
   //４発目 が答えではない
];


?>